src/test/taurus/test.yml
---
execution:
- concurrency: 60
  hold-for: 2m
  ramp-up: 60s
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - label: blazedemo
      method: GET
      url: http://blazedemo.com/
    - body:
        fromPort: Paris
        toPort: Buenos Aires
      label: reserve
      method: POST
      url: http://blazedemo.com/reserve.php

reporting:
- module: console
#- module: final-stats
#  summary: true
#  percentiles: true
#  failed-labels: false
#  test-duration: true
#  dump-csv: TaurusResult/perf_result_csv.csv
- module: junit-xml
  data-source: pass-fail
  filename: TaurusResult/junit-result.xml
- module: final-stats
  dump-xml: stats.xml
#modules:
#  blazemeter:
#    token: 412d5a8846c9883881798394:57e11097a3b10a5645b9784680cca648bfeb576a0af7fb2110a98be4dabb4516fb09b19c  # API id and API secret joined with ':'
#    test: Taurus Local Test  # name for test to store reports
#    project: My Taurus Project  # name for project to store test, can be numeric project ID
#    public-report: false  # set to true to create a public link to the report

settings:
#  default-executor: jmeter  # if you prefer using other executor by default - change this option
  artifacts-dir: ~/bzt-artifacts/%Y-%m-%d_%H-%M-%S.%f  # change the default place to store artifact files
  check-updates: true  # check for newer version of Taurus on startup
#  check-interval: 1s  # interval for Taurus engine to check test status and do other actions
#  proxy:  # custom proxy settings
#    address: http://127.0.0.1:8080  # proxy server address
#    username: user  # username and password used if authentication is configured on proxy server
#    password: 12345


#service:
#- module: monitoring
#  server-agent:
#  - address: 192.168.1.3:4444
#    metrcs:
#    - cpu
#    - discs
#    - memory